rheoTool/tutorials/rheoEFoam/selecMembrane/NernstPlanck/solution1D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-06;

vertices
(
  (0 0 0)
  (60 0 0)
  (60 10 0)
  (0 10 0)
  
  (0 0 10)
  (60 0 10)
  (60 10 10)
  (0 10 10)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1 90 1) simpleGrading (1 41.67 1)     
);

edges
(
);

boundary
(
     cyc0
     {
      type cyclic;
      neighbourPatch  cyc1;
      faces
      (
            (0 3 7 4)           
      );
    }
    
    reservoir
    {
        type wall;
        faces
        (
            (3 2 6 7)      
        );
    }
    
    membrane
    {
        type wall;
        faces
        (
            (0 1 5 4)              
        );
    }
    
    cyc1
    {
       type cyclic;
       neighbourPatch  cyc0;
        faces
        (
            (1 2 6 5)        
        );
    }
    
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)  
            (4 5 6 7)    
        );
    }
        
);

mergePatchPairs
(
);

// ************************************************************************* //
